{
  "aboutData": [
    {
      "date": "2023",
      "title": "MLOps Engineer",
      "at": "ExxactRobotics",
      "description": "During my time at ExxactRobotics as an MLOps, I played a crucial role in optimizing data processing pipelines. By refactoring the pipelines in Python and automating processes with tools such as Jenkins, Azure, Minio, ZenML, Kubernetes (K8s), and Ansible, we were able to dramatically speed up data processing. In fact, our code enabled speeds up to 30 times faster than before. This significant improvement in data processing speed had a direct impact on the overall efficiency of the company, reducing wait times and enabling quicker decision-making.",
      "skills": "Kubernetes, Minio, ZenML, Linux, Azure DevOps, Docker Products, Python",
      "image": "about_pics/devops.png",
      "image_alt": "DevOps Engineer"
    },
    {
      "date": "2022",
      "title": "Front-end Engineer",
      "at": "AGCO",
      "description": "I had the opportunity to work on integration in QSkinny (a Qt framework) for the user interface of an AGCO tractor. This experience allowed me to develop programming skills in C++ and gain a deep understanding of designing complex and efficient user interfaces. These programming and interface design skills have strengthened my ability to create user experiences as a front-end engineer.",
      "skills": "Figma, Front-end Development, Agile Methodologies, Jenkins, Qt, Qskinny, C++",
      "image": "about_pics/software.png",
      "image_alt": "Software Engineer"
    },
    {
      "date": "2020",
      "title": "Student",
      "at": "42 Paris School",
      "description": "Studying at École 42 has provided me with a strong foundation in software engineering, including but not limited to algorithms, data structures, and low-level programming. The school's project-based, peer-to-peer learning environment has also equipped me with excellent problem-solving and teamwork skills.",
      "skills": "Algorithms, Data Structures, Low-level Programming, Problem-solving, Teamwork",
      "image": "about_pics/42_school.png",
      "image_alt": "School 42 Paris"
    },
    {
      "date": "2018",
      "title": "Educational Engineer",
      "at": "Colombbus and Play n' Prog",
      "description": "In my previous role as a Computer and Robotics Instructor, I was responsible for teaching Scratch and other playful learning platforms to young learners. This experience was not only rewarding but also honed my skills in educational technology and curriculum development. I was able to create engaging and interactive lessons that made complex concepts accessible and fun. This role enhanced my understanding of user engagement, which is an invaluable skill in front-end development.",
      "skills": "Educational Technology, Curriculum Development, Scratch, Student Engagement",
      "image": "about_pics/school.png",
      "image_alt": "Educational Engineer"
    },
    {
      "date": "2017",
      "title": "Student",
      "at": "University of Paris",
      "description": "My computer science degree at Université Paris 7 Diderot has given me a solid grounding in various domains like programming, operating systems, networks, and databases. The curriculum also included a strong mathematical component, which has been invaluable in my coding projects.",
      "skills": "Programming, Operating Systems, Networks, Databases, Mathematics",
      "image": "about_pics/university.png",
      "image_alt": "University of Paris"
    },
    {
      "date": "2014",
      "title": "Early Coding Experience",
      "at": "Home",
      "description": "I started coding during my high school years, initially as a hobby. This early exposure to programming has given me a long runway to develop my skills and has been instrumental in shaping my career path.",
      "skills": "Self-learning, Early Exposure to Programming",
      "image": "about_pics/software.png",
      "image_alt": "University of Paris"
    }
  ]
}